Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/shijing__xiaoya-yuzao-002__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 采菽采菽，筐之筥之。君子來朝，何錫予之？ 雖無予之，路車乘馬。又何予之？玄袞及黼。
en: They gather the beans, they gather the beans, In their baskets, square and round. The princes are coming to court, And what gifts have I to give them? Although I have none to give them, There are the state carriages and their teams. What more have I to give them? The dark-coloured upper robes with the dragon, And the lower garments with the hatchet.

source: 觱沸檻泉，言采其芹。君子來朝，言觀其旂。 其旂淠淠，鸞聲嘒嘒。載驂載駟，君子所屆。
en: Right up bubbles the water from the spring, And they gather the cress about it. The princes are coming to court, And I see their dragon flags; — Their dragon flags moving in the wind, While the sound of their bells comes liwuy-liwuy. There are the two outside horses, there are the whole teams, — Proofs that the princes are come.

source: 赤芾在股，邪幅在下。彼交匪紓，天子所予。 樂只君子，天子命之。樂只君子，福祿申之。
en: Their red covers on their knees, And their buskins below, DECADE OF SANG HOO. There is no remissness in their demeanour; — Of such should the son of Heaven approve. To be rejoiced in are the princes, And the son of Heaven gives them the badges of his favour. To be rejoiced in are the princes, And their happiness and dignities are renewed and extended.

source: 維柞之枝，其葉蓬蓬。樂只君子，殿天子之邦。 樂只君子，萬福攸同。平平左右，亦是率從。
en: On the branches of the oaks, How abundant are the leaves! To be rejoiced in are the princes, Guardians of the regions of the son of Heaven. To be rejoiced in are the princes, Around whom all blessings collect. Discriminating and able are their attendants, Who also have followed them hither.

source: 汎汎楊舟，紼纚維之。樂只君子，天子葵之。 樂只君子，福祿膍之。優哉游哉，亦是戾矣。
en: It floats about, the boat of willow wood, Fastened by the band of the rope. To be rejoiced in are the princes, And the son of Heaven scans their merits. To be rejoiced in are the princes, And their happiness and dignities are enlarged. How joyous, how happy, Is their coming here!
